src/Documents/ИТСервисы_ПриказОВводеВПЭ/ИТСервисы_ПриказОВводеВПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ПриказОВводеВПЭ</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПриказыСервисы</name>
    <attributes>
      <name>ИТСервис</name>
      <type>
        <types>CatalogRef.ИТСервисы_ИТСервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВвода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_ПараметрыИТСервисов/ИТСервисы_ПараметрыИТСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_ПараметрыИТСервисов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаРазвитии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСопровождении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДорожнаяКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриказОВводеВПЭ</name>
    <type>
      <types>DocumentRef.ИТСервисы_ПриказОВводеВПЭ</types>
    </type>
  </resources>
  <resources>
    <name>ПаспортСервиса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Архитектура</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БазаЗнаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорТП</name>
    <type>
      <types>Boolean</types>
      <types>DocumentRef.ИТСервисы_ДоговорСТехническимПровайдером</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИТСервисы_ПриказОВводеВПЭ/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПриказОВводеВПЭ
// Модуль объекта документа
////////////////////////////////////////////////////////////////////////////////

#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт

	Если ПриказыСервисы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена табличная часть с ИТ-сервисами!";
		Сообщение.Поле = "ПриказыСервисы";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ИТСервисы_ПараметрыИТСервисов.Записывать = Истина;
	Движения.ИТСервисы_ПараметрыИТСервисов.Очистить();
	
	ЗаписатьДвиженияПоПараметрамСервисов();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ЗаписатьДвиженияПоПараметрамСервисов
////////////////////////////////////////////////////////////////////////////////
Процедура ЗаписатьДвиженияПоПараметрамСервисов()

	СостоянияПоСервисам = ПолучитьПредыдущиеСостоянияПараметров();
	
	Для Каждого СтрокаТЧ Из ПриказыСервисы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ИТСервис) Тогда
			Продолжить;
		КонецЕсли;
		
		ПредыдущееСостояние = СостоянияПоСервисам.Получить(СтрокаТЧ.ИТСервис);
		
		Если ПредыдущееСостояние = Неопределено Тогда
			ПредыдущееСостояние = ПолучитьПустоеСостояниеПараметров();
		КонецЕсли;
		
		ЗаписьПараметров = Движения.ИТСервисы_ПараметрыИТСервисов.Добавить();
		ЗаписьПараметров.Период = Дата;
		ЗаписьПараметров.ИТСервис = СтрокаТЧ.ИТСервис;
		
		ЗаполнитьЗначенияСвойств(ЗаписьПараметров, ПредыдущееСостояние);
		
		ЗаписьПараметров.ПриказОВводеВПЭ = Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПустоеСостояниеПараметров()

	Состояние = Новый Структура;
	Состояние.Вставить("НаРазвитии", Ложь);
	Состояние.Вставить("НаСопровождении", Ложь);
	Состояние.Вставить("ПланПроектаВИСУП", Ложь);
	Состояние.Вставить("КодВАРМРазработчика", "");
	Состояние.Вставить("ДорожнаяКарта", Ложь);
	Состояние.Вставить("ПриказОВводеВПЭ", Неопределено);
	Состояние.Вставить("ПаспортСервиса", Ложь);
	Состояние.Вставить("Архитектура", Ложь);
	Состояние.Вставить("БазаЗнаний", Ложь);
	Состояние.Вставить("ДоговорТП", Неопределено);
	Состояние.Вставить("Руководитель", Неопределено);
	
	Возврат Состояние;

КонецФункции

Функция ПолучитьПредыдущиеСостоянияПараметров()

	СоответствиеСостояний = Новый Соответствие;
	МассивСервисов = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ПриказыСервисы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ИТСервис) Тогда
			МассивСервисов.Добавить(СтрокаТЧ.ИТСервис);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСервисов.Количество() = 0 Тогда
		Возврат СоответствиеСостояний;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Срез.ИТСервис КАК ИТСервис,
	|	Срез.НаРазвитии КАК НаРазвитии,
	|	Срез.НаСопровождении КАК НаСопровождении,
	|	Срез.ПланПроектаВИСУП КАК ПланПроектаВИСУП,
	|	Срез.КодВАРМРазработчика КАК КодВАРМРазработчика,
	|	Срез.ДорожнаяКарта КАК ДорожнаяКарта,
	|	Срез.ПриказОВводеВПЭ КАК ПриказОВводеВПЭ,
	|	Срез.ПаспортСервиса КАК ПаспортСервиса,
	|	Срез.Архитектура КАК Архитектура,
	|	Срез.БазаЗнаний КАК БазаЗнаний,
	|	Срез.ДоговорТП КАК ДоговорТП,
	|	Срез.Руководитель КАК Руководитель
	|ИЗ
	|	РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(
	|		&МоментДо,
	|		ИТСервис В (&МассивСервисов)) КАК Срез";
	
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("МассивСервисов", МассивСервисов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Состояние = ПолучитьПустоеСостояниеПараметров();
		ЗаполнитьЗначенияСвойств(Состояние, Выборка);
		
		СоответствиеСостояний.Вставить(Выборка.ИТСервис, Состояние);
		
	КонецЦикла;
	
	Возврат СоответствиеСостояний;

КонецФункции

#КонецОбласти


#Область ПроверкаЗаполнения

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ПриказыСервисы.Количество() = 0 И ПроверяемыеРеквизиты.Содержит("ПриказыСервисы") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена табличная часть 'Приказы сервисы'!";
		Сообщение.Поле = "ПриказыСервисы";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ПриказыСервисы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ИТСервис) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В табличной части есть строка без ИТ-сервиса!";
			Сообщение.Поле = "ПриказыСервисы";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
